#ifndef CHARGE_H
#define CHARGE_H

#include "common.h"

/************************************
功能描述：正在充电吗
输入参数：无
输出返回：是返回BOOL_TRUE， 否则返回 BOOL_FALSE
*************************************/
extern boolean_en charge_is_charging(void);


/************************************
功能描述：充满电了吗
输入参数：无
输出返回：满电返回BOOL_TRUE， 否则返回 BOOL_FALSE
*************************************/
extern boolean_en charge_is_full(void);



/************************************
功能描述：充电IC状态初始化
输入参数：无
输出返回：无
*************************************/
extern void charge_init(void);


/************************************
功能描述：定时器 10 ms执行一次
输入参数：无
输出返回：无
*************************************/
extern void charge_timer(void);


/************************************
功能描述：不滤波，立刻更新
输入参数：无
输出返回：无
*************************************/
extern void charge_reflash(void);

#endif
